
var artical = localStorage.getItem("artical");
if (artical == "one" ){
   document.querySelector(".artical-container").innerHTML=
   `<h1>المفعول معه</h1>
   <div class="artical-img"> <img src="images/public/artiacal1.png"></div>
   <span class="date">بواسطة | حسن محمد حسن </span>
   <div class=" artical-body">
       <p><b>لو بصينا في الأمثلة دي: </b><br>
           1- استيقظ النائم وأذان الفجر.<br>
           2- مشيت وشاطئ النيل.<br>
           3- سار القطار وخط السكة الحديد.<br>
           4- ذهبت إلى المدرسة وطلوع الشمس.<br><br>
           <span style="color: #333;">- في المثال الأول (استيقظ النائم وأذان الفجر) ...</span>
           مستحيل الواو تبقي واو عطف ... لأنها لو واو عطف هيبقي المعني ان النائم استيقظ وكمان الفجر استيقظ !! ... دي مش واو عطف ... دي حاجة جديدة اسمها واو المعية واللي بييجي بعدها اسمه مفعول معه ... 
           <br>
           وده موضوع الدرس ... واو معية يعني معني الجملة (استيقظت مع أذان الفجر) حشنا الواو وحطينا بدالها (مع) ... طالما المعني فضل سليم تبقى دي واو معية واللي بعدها مفعول معه ... وكدة يبقى اعراب (استيقظ النائم وأذان الفجر) ... (وأذان الفجر) الواو واو معية ... أذان مفعول معه منصوب بالفتحة ... الفجر مضاف إليه.
           <br><br>
           - في الأمثلة الباقية (مشيت وشاطئ النيل) – (سار القطار وخط السكة الحديد) – (ذهبت إلى المدرسة وطلوع الشمس) ... نفس الكلام الواو مستحيل تبقي واو عطف لنفس سبب المثال الأول ... وكمان ينفع نشيل الواو ونحط بدالها (مع) ويفضل المعني سليم ... فكدة تبقي (شاطئ – خط – طلوع) مفعول معه منصوب بالفتحة.
           <br><br>
           <span style="color: #333;">الفرق بين واو المعية  وواو الحالية:-</span><br>
           1- واو المعية : يأتي بعدها اسم (مضاف ومضاف اليه – نعت ومنعوت ... الخ الخ) ... ولا يأتي بعدها جملة (مبتدأ وخبر- فعل وفاعل) ... ويمكن استبدالها ب (مع) ... زي (جئت وهطول المطر) – (ذكرتك وتوديع النهار) – (رحلت وشروق الشمس) .... هنا (هطول المطر – توديع النهار – شروق الشمس) دول كلهم اسماء عشان كدة إعراب (هطول – توديع – شروق) مفعول معه منصوب بالفتحة.
           <br><br>
           2- واو الحالية : يأتي بعدها جملة ... ولا يمكن استبدالها ب (مع) ... زي (جئت والمطر يهطل) – (ذكرتك والنهار مودع) – (رحلت والشمس مشرقة) ... هنا (المطر يهطل – النهار مودع – الشمس مشرقة) دول كلهم جمل كم مبتدأ وخبر عشان كدة كلهم جمل اسمية في محل نصب حال.

   </div><!-- ./artical-body -->`
}

if(artical =="two"){
   two= document.querySelector(".artical-container").innerHTML= 
   `   <h1>اسم الإشارة والبدل</h1>
   <div class="artical-img"><img src="images/public/artical2.jpg"></div>
   <span class="date">بواسطة | حسن محمد حسن </span>
   <div class=" artical-body">
       <p><span style="color: #333;">(اسم إشارة + كلمة معرفة بال) </span>= بدل ... بس مش دايما ... لازم اسم الإشارة يكون قصدي بيه اللي بعديه عشان يبقى بدل.<br>
           فمثلا لو قلت ... (اجتهد لحل هذه المشكلة) .... قصدك ايه بهذه؟ المشكلة ... عشان كدة المشكلة بدل.<br>
           لكن ... لو قلت (العلم نور وينكر ذلك الجهلاء) .... هنا قصدي مين بذلك؟ ... أكيد مش قصدي الجهلاء ... أنا قصدي أن العلم نور بينكروا أن العلم نور ... فبالتالي طالما مش قصدي بيها اللي بعديها يبقى اللي بعدها مش بدل ... تبدأ تشوف حاجة تانية ... مين اللي بينكر؟ الجهلاء ... تبقى الجهلاء هنا فاعل مش بدل وهكذا.<br>
           وكذلك لو قلت (نحن نسعى للتقدم وسوف يساعدنا على ذلك البحث العلمي) ... هنا (ذلك) قصدك بيها (البحث العلمي) اللي بعدها؟ لأ ... يبقى خلاص مش بدل وتشوف إعراب تاني وهيكون إعرابها فاعل بردو لأنها بتساعدنا.<br>
           ولو قلنا (مصر مليئة بكل تلك الخيرات) ... فهنا كلمة (تلك) قصدي بيها (الخيرات) اللي جت بعديها فبالتالي (الخيرات) بدل.
           باقي ملحوظة أخيرة هقولها في آخر الدرس ... ثبّت أنت دي حاليا ^^.<br><br>
           <span style="color: #333;">- بعد مدة -  </span>
           قلت إن فيه ملحوظة أخيرة لقاعدة اسم الإشارة وهنقولها بقى ^^.
           <br>
           اعرف دايما أن فيه حاجة أولى من حاجة ... يعني مثلا مش هتكون جعان ومعاك فلوس ع القد ومحتاج تاكل فتقوم تشتري جزمة! .... لأ محتاج تاكل يبقى تجيب حاجة تاكلها الأول بعدين بقى تبقى تشوف الجزمة بتاعتك دي.            <br><br>
           نفس الكلام دا في النحو ..... يعني لما أقولك (هذه الثمرة المرجوة) وأطلب منك تعرب فتقول ... (هذه) مبتدأ و(الثمرة) بدل و(المرجوة) نعت ... سؤال بسيط بس؟ هو مش المبتدأ محتاج خبر؟ اه .... اومال هو فين الخبر؟ كدة الجملة فيها مبتدأ من غير خبر فاعرف ع طول أن إعرابك غلط.            <br><br>
           احنا هنقول إن (الثمرة) خبر .... ليه مش بدل مع أن شروطه متحققة؟ ... دا لأن ما فيش حاجة تقوم بدور الخبر غيرها.<br>
           <br>
           أما لو كانت الجملة (هذه الثمرة المرجوة جميلة) .... هنا خلاص تقدر تقول (الثمرة) بدل لأن فيه خبر خلاص وهو كلمة (جميلة)
فركز ع النقطة دي خاصة لما يكون فيه مبتدأ في الأول وغالبا بيكون ساعتها اسم الإشارة في أول الجملة أو قبله فاء أو واو ... ندي أمثلة أحسن عشان ما تتوهش ^^ ... زي (اجتهدوا لتنجحوا فهذه الثمرة المرجوة) – (الاجتهاد غايته النجاح وهذه الثمرة المرجوة) ... هنا (الثمرة) خبر في الاتنين.
           <br><br>
           <span style="color: #333;">#ملحوظتان:</span>
           1- لو اسم الإشارة كان بيشير للحاجة اللي قبله بالظبط يبقى نعت ليه ... زي (قم من مقامك هذا) ... هنا (هذا) اسم إشارة مبنى في محل جر نعت لـ(مقامك).
2- ممكن بدل ما يقول (ذلك – تلك) يقول (ذلكم – تلكم) ... ودول اسماء إشارة عاديين جدا بردو وما فيش أي فرق ... فمش تقلق وحط مكانهم اسم إشارة بشكله العادي لو هتتلغبط.
<br>
وممكن ييجي بعدهم أي إعراب مش لازم إعراب ثابت.

   </div><!--./artical-body-->
   `
    
}
if(artical =="three"){
   two= document.querySelector(".artical-container").innerHTML= 
   `<h1>الأفعال التي تنصب مفعولين ليس أصلهما المبتدأ والخبر </h1>
   <div class="artical-img"> <img src="images/public/artical3.jpg"></div>
   <span class="date">بواسطة | حسن محمد حسن </span>
   <div class=" artical-body">
       <p><span style="color: #333;">- أفعال الشحاتة </span> (كسا – منح – أعطى – وهب – آتى – ألبس – سأل ]بمعنى طلب [– منع) ... ودول مش أفعال ناسخة لأنها مش بتدخل على جملة اسمية أساسا ^_^.
           زي (وهب الله الانسان العقل) – (أعطي الرئيس البطل ميدالية) – (منحت أحمد قلما) – (كساني العلم أخلاقا فاضلة) – (آتينا لقمان الحكمة) – (ألبستك بنطالا) – (سألت الله الهداية) – (منعتك الطعام).<br>
           <br>
           <span style="color: #333;">- (منحت الميداليات للمتفوقين تكريما لهم)</span>
           ... هنا (تكريما) مفعول لأجله لأنها مصدر وضح سبب الفعل... ومش مفعول به ثان .... مش أي كلمتين منصوبين يقابلوك بعد فعل بينصب مفعولين يبقوا هما المفعول الأول والتاني ... لأ دا ليهم حاجة بتحددهم .... في الأفعال اللي فاتت كنا بنعرفهم من إن أصلهم المبتدأ والخبر ... في أفعال الشحاتة بيبقي المفعول الأول عبارة عن الشخص اللي أخد ... المفعول التاني عبارة عن الحاجة اللي اتاخدت .... وهكذا يبقي المفعولين هما (الميداليات) وشبه الجملة (للمتفوقين).
           <br><br>
           <span style="color: #333;">- (أعطيت لك القلم هدية)</span>
           .... المفعولين هما شبه الجملة (لك) و(القلم) ... أما (هدية) مش مفعول به ... لأنها مش الشيء المعطى ... (هدية) هنا مش مصدر ... وبالتالي ما تنفعش مفعول لأجله ... لأن المفعول لأجله لازم يكون مصدر... (هدية) حال منصوب .... كلمة نكرة وصفت كلمة معرفة ... وصفنا القلم بأنه هدية ... ومعلومة ليك مش لازم الحال يكون مشتق ... المهم نكرة منصوبة توصف كلمة معرفة زي (أقبل علينا الجندي أسدا) ... (أسدا) حال ...وكمان لو كنا قلنا (أعطيت لك هدية) كانت هتبقى (هدية) مفعول به ... لأنها كدة هي الشيء المعطى.
           <br><br>
           <span style="color: #333;">
               - (أعطيت لك المال جائزة لتفوقك)<br>
                – (أعطيت لك المال جزاء لتفوقك) <br>
                – (أعطيت لك جائزة لتفوقك)<br>
               </span>
               ... درب نفسك .

   </div><!--./artical-body-->`
    
}


window.onscroll = function(){
    if(window.pageYOffset >=600){
        document.getElementById("goUp").style.display = "block"
    }else{
        document.getElementById("goUp").style.display = "none"
    }
}